# 주석 : 설명을 적기 위한 문법

# 파이썬의 특징 : 인터프리터 언어
# -> 코드를 실시간으로 처리해서 결과를 보여주는 방식
# -> 동시에 여러줄의 처리가 필요하면 반드시 소스파일이 있어야 한다!

# < - > 컴파일 언어
# -> 코드를 프로그램으로 바꾼 다음에 결과를 볼 수 있는 방식

# 변수의 활용방법1 : 값어치가 있는 것을 저장해라
# 변수의 활용방법2 : 중복처리가 된다
name="임꺽정"
print("이름 :",name)
print("나이 : 24")
print("취미 : 코딩")
# 상수의 활용1 : 변수 생성, 필요한 값을 개발자가 직접 준비한다.
# 상수의 활용2 : 값을 바꿀 수 없도록 만든다.

# print가 담당하는 것 : 값을 조합하여 출력한다.

# 소스파일 생성시 팁
# 새로운 내용이 나오거나, 새로운 실습을 하면
# 새로운 소스파일을 만드는 것이 좋다.
# -> 나중에 다시 볼 때 편하도록 구분하는게 좋다.














