# 코드 : 특정 프로그래밍 언어로 작성된 내용
# 문법 : 코드를 효율적으로 작성하기 위한 규칙
# 소스파일 : 코드가 작성되어 저장된 파일

# 변수의 생성 : 적당한이름 = 문법에맞는값
# 정수 : num, 여러개면 num1,num2,num3
num=100
num1=123
num2=333
# 실수 : fnum, 여러개면 위와 동일하게 들어간다
fnum1=3.14
fnum2=9.99
# 문자 : ch(단문자), word(단어), msg(문장)
ch="A"
word="Apple"
msg="하나의 어떤 문장이다!"
# 값들이 어떤 특정 결과, 의미가 있다...
# name, age, dream, result, object, value, var, etc 등등....

# 하나면 한개만, 여러개면 쉼표로 구분한다.
print(num,num1,num2,ch,word,fnum1,num,fnum1)

# 문법요소
# 1) 한줄당 하나의 코드만 작성한다
# 2) 띄어쓰기, 엔터등은 결과에 반영되지 않는다.
# 3) 띄어쓰기, 엔터는 사용할 수 있는 곳이 한정되어 있다.
#    띄어쓰기는, 첫번째로 넣을 수 없다.
#    엔터는 괄호 내에서만 한정적으로 사용할 수 있다.






