# 프로그램 : 자료 - 처리 - 정보

# 자료 - 상수(직접 수집한 것) / 입력(실시간 수집)
# 상수 - 정수 / 실수 / 문자열 / 논리값 / 기타 등등등....
# 입력 - 문자열로만 준비된다.

# 처리 - 연산 + 제어문

# 정보 - 결과물(출력하는 것)

# 변수 : 상수/입력을 관리할 수 있는 식별해놓은 공간
# - 중복처리(값, 연산된 결과물, 처리과정도 포함됨)
# - 특정용도로 사용되는 값에 대해 이름을 붙여 구별하기

# 자료형 : 값의 종류, 속성
# - 이를 <용도에 맞게> 바꾸는 것 : 형변환

# 코딩은 신경써야될 것이 많다!
# 어떤 의도로 이 코드를 작성했나? 라는 의도를 담아야 한다.
# input : 출력이 아니다
# - 괄호안에 문자열을 배치하여, 무엇이 필요한지 사용자에게 안내하고...
#   그렇게 입력을 받은 내용을 사용된 곳에 배치한다.
# print : 입력이 아니다
# - 괄호안에 배치되는 서로 다른/같은 종류의 값들을 조합하여...
#   화면에 보여준다
name=input("이름을 넣어주세요 ")
print("이름 :", name)
















